{"project":{"settings":{"base":"/Users/aleksandramokric/Norovirus-spec","settings_path":"/Users/aleksandramokric/Norovirus-spec/.art/settings.toml","code_paths":[],"exclude_code_paths":[],"artifact_paths":["/Users/aleksandramokric/Norovirus-spec/design"],"exclude_artifact_paths":[],"code_url":null,"parse":{"md_name":{"type":"default"}},"format":{"md_attrs":{"type":"hashes"}},"export":{"md_header":null,"md_toc":false,"md_family":{"type":"list"},"md_dot":{"type":"ignore"},"md_name":{"type":"default"}}},"code_impls":{},"artifacts":{"REQ-engine":{"id":"0juMc0zvRalzGw-FvZoeDQ","name":"REQ-engine","file":"/Users/aleksandramokric/Norovirus-spec/design/high_structure.md","partof":["REQ-purpose"],"parts":["SPC-engine"],"completed":{"spc":0.0,"tst":0.0},"text":"## Engine\nThis will execute the model given certain conditions.\n\n### This model shall meet these conditions to execute the programme:\n- An \"initial\" sick student, which is randomly assigned, in order to start the actual transmission of disease.\n- The network connections for the students\n- The assigned sizes for the classes and groups.\n","impl_":{"type":"NotImpl"},"subnames":[]},"REQ-model":{"id":"qCawR9jP1w-f-S2CejtaIw","name":"REQ-model","file":"/Users/aleksandramokric/Norovirus-spec/design/high_structure.md","partof":["REQ-Purpose"],"parts":["SPC-model"],"completed":{"spc":0.0,"tst":0.0},"text":"## Model\n\n\nThis initialises the model with all the details need to run the simulation, as well as, generating the agents, generating the network and setting up the connections. \n\n### Setting up the model \n\n#### Network for the model:\n\nAccording to the paper, the network was created as a small-world network in a lattice structure, allowing the student to pair with their neighbours on either side.\n\n#### Initial model parameters:\n\nFor the model to work we will need to generate our students. The total number of students is 126.\n\nThe school size is based on:\n\n- Classroom size = 21 students\n- Number of Classrooms = 6\n\nThe other parameters that will be required are:\n- Risk of Infection = 50%\n- Illness Rate (Post Infection) = 10%\n- Incubation period = 2 days\n- Symptomatic (Isolation) period = 3 days\n- School Days per Week = 5 days\n- Weekend Days per Week = 2 days\n\n#### The connections\n\nCreating Neighbour Networks:\n\n- In the classroom, each person has a 60% probability to rewire a connection on, allowing students to pair with neighbours on either side of the desk. The network shall allow students in a classroom to have at least two neighbours beside them to be assigned.\n\nCreating Friendship Networks:\n\n- Connections formed with students outside of the classroom are given a 10% chance of rewiring.\n","impl_":{"type":"NotImpl"},"subnames":[]},"REQ-output":{"id":"PbwCkvbtgBCyoqDxTNJFOg","name":"REQ-output","file":"/Users/aleksandramokric/Norovirus-spec/design/high_structure.md","partof":["REQ-purpose"],"parts":[],"completed":{"spc":0.0,"tst":0.0},"text":"What shall be outputted from the programme after it has been run.\n### Programme Report\n\nWhen the program is complete it shall report:\n1. Stabilising results across runs:\n- Outbreak duration (days), this will include data from multiple runs.\n2. Baseline Simulation Results:\n\nFrom the data that is gathered from the runs, this will allow for specific results to be acquired for analysis.\n- Duration (days)\n- Duration range (days)\n- Max Absentee Rate \n- Total Number of Students Affected \n- Range of students affected across runs\n","impl_":{"type":"NotImpl"},"subnames":[]},"REQ-purpose":{"id":"ZQIr1nwoh0f8We5s0o1tlA","name":"REQ-purpose","file":"/Users/aleksandramokric/Norovirus-spec/design/purpose.md","partof":[],"parts":["REQ-engine","REQ-model","REQ-output"],"completed":{"spc":0.0,"tst":0.0},"text":"The goal of this project is to develop a reasonable replication of the Norovirus Model from the paper [NOROVIRUS OUTBREAKS: USING AGENT-BASED MODELING TO EVALUATE SCHOOL POLICIES](https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7822182).\n\nThe paper examines the transmission of the virus among primary school classrooms, evaluating policies to reduce the number of children who become infected. It focuses on the daily activities that allow for students’ exposure to the virus including classroom activities and lunch. \n\nTo control the transmission, two policies were implemented to limit the amount of student-student interaction. The results demonstrated that implementation of either policy helps reduce the number of students who become ill and that the sooner the policy is implemented the shorter the duration of the outbreak.\n\n\n## Goal\n\nThe model shall simulate the spread of norovirus through a series of elementary school classrooms and implement policies in order to reduce the number of children who become infected. \n\n  ## Structure\n  \n\n- [[ REQ-model]] - The model setup. This will initialise the model with all the details needed to run the simulation, it will include the generation of the students and the network, which allow for the chance of infection to be evaluated between the students.\n- [[ REQ-engine]] - The model will need certain conditions to be executed.\n","impl_":{"type":"NotImpl"},"subnames":[]},"SPC-engine":{"id":"BfCM2kYEYpF6ZCvBBi8ghQ","name":"SPC-engine","file":"/Users/aleksandramokric/Norovirus-spec/design/high_structure.md","partof":["REQ-engine"],"parts":[],"completed":{"spc":0.0,"tst":0.0},"text":"At the start of each simulation the following parameters shall be randomly assigned: \n\nIn order for the simulation to commence, there will need to be the initial ‘sick’ student and the network connections of each student should be set up.\n\n### [[.generate_students]]: generation of the students\nThe students for the model shall be generated. The setup for this is will require to assign the parameters for the students. All the students will be \"Healthy\", except for the random \"Sick\" student. \n\n### [[.generate_sick_student]]: generation of random sick student\n\nTo run the simulation and for the model to do what it supposed to, which is spreading infection, an \"initial\" sick student will be randomly generated to start the infection spread.\n\n### [[.network]]: generation of the student network\nThe generation of the student network will allows for all the connections to be made, within the classroom and outside the classroom.\n","impl_":{"type":"NotImpl"},"subnames":[".generate_sick_student",".generate_students",".network"]},"SPC-model":{"id":"UhkXmlWYitgtI2dqjHmScQ","name":"SPC-model","file":"/Users/aleksandramokric/Norovirus-spec/design/high_structure.md","partof":["REQ-model"],"parts":[],"completed":{"spc":0.0,"tst":0.0},"text":"\nThe main goal of the model is to generate the students, the network of the students, connecting them to their seatmates, groups and friends, so that the model can run and output the report.\n\n\n- [[.init]]: Initialise the required model parameters.\n\n\nEvaluating the chances of infection:\n\n- Neighbours: The probability of getting infected is 10%.\n\n`p_of_infection_neighbour = 0.10`\n\nThe neighbour chance applies to group work as well, it is the same probability.\n\n- Friend: The probability of getting infected is 12%.\n\n`p_of_infection_friend = 0.12`\n\n\nEach day you evaluate all the chances, therefore evaluating the chance of infection twice. When the students are in their classroom doing group work or at lunch, the chances of them being infected shall be evaluated.\n","impl_":{"type":"NotImpl"},"subnames":[".init"]}}},"web_type":"Static"}